[
  {
    "id": "2022r1",
    "name": "Imran Chowdhury",
    "ratings": 4,
    "review": "An extremely powerful story of a young Southern Negro, from his late high school days through three years of college to his life in Harlem.His early training prepared him for a life of humility before white men, but through injustices- large and small, he came to realize that he was an 'invisible man'. People saw in him only a reflection of their preconceived ideas of what he was, denied his individuality, and ultimately did not see him at all. This theme, which has implications far beyond the obvious racial parallel, is skillfully handled. The incidents of the story are wholly absorbing."
  },
  {
    "id": "2022r2",
    "name": "Arefin Chowdhury",
    "ratings": 4.5,
    "review": "YOU ARE THE DEAD Oh my God. I got the chills so many times toward the end of this book. It completely blew my mind. It managed to surpass my high expectations AND be nothing at all like I expected. Or in Newspeak 'Double Plus Good'. Let me preface this with an apology. If I sound stunningly inarticulate at times in this review, I can't help it. My mind is completely fried.This book is like the dystopian Lord of the Rings, with its richly developed culture and economics, not to mention a fully developed language called Newspeak, or rather more of the anti-language, whose purpose is to limit speech and understanding instead of to enhance and expand it. The world-building is so fully fleshed out and spine-tinglingly terrifying that it's almost as if George travelled to such a place, escaped from it, and then just wrote it all down."
  },
  {
    "id": "2022r3",
    "name": "Alan Orlin",
    "ratings": 4,
    "review": "Three-quarters of the way through Lisa Halliday's debut novel, “Asymmetry,” a British foreign correspondent named Alistair is spending Christmas on a compound outside of Baghdad. His fellow revelers include cameramen, defense contractors, United Nations employees and aid workers. Someone's mother has FedExed a HoneyBaked ham from Maine; people are smoking by the swimming pool. It is 2003, just days after Saddam Hussein's capture, and though the mood is optimistic, Alistair is worrying aloud about the ethics of his chosen profession, wondering if reporting on violence doesn't indirectly abet violence and questioning why he'd rather be in a combat zone than reading a picture book to his son. But every time he returns to London, he begins to “spin out.” He can't go home. “You observe what people do with their freedom — what they don't do — and it's impossible not to judge them for it,” he says."
  },
  {
    "id": "2022r4",
    "name": "Moris Johnson",
    "ratings": 5,
    "review": "In Doane's debut novel, a young man embarks on a journey of self-discovery with surprising results.An unnamed protagonist (The Narrator) is dealing with heartbreak. His love, determined to see the world, sets out for Portland, Oregon. But he's a small-town boy who hasn't traveled much. So, the Narrator mourns her loss and hides from life, throwing himself into rehabbing an old motorcycle. Until one day, he takes a leap; he packs his bike and a few belongings and heads out to find the Girl."
  },
  {
    "id": "2022r5",
    "name": "Lady Gaga",
    "ratings": 4.5,
    "review": "I am still dipping my toes into the literally fiction pool, finding what works for me and what doesn't. Books like The Care and Feeding of Ravenously Hungry Girls by Anissa Gray are definitely my cup of tea.Althea and Proctor Cochran had been pillars of their economically disadvantaged community for years  with their local restaurant/small market and their charity drives. Until they are found guilty of fraud for stealing and keeping most of the money they raised and sent to jail. Now disgraced, their entire family is suffering the consequences, specially their twin teenage daughters Baby Vi and Kim.  To complicate matters even more: Kim was actually the one to call the police on her parents after yet another fight with her mother."
  },
  {
    "id": "2022r6",
    "name": "Samira Khan",
    "ratings": 5,
    "review": "5 stars! I can't imagine how challenging it would be to tackle the voice of a movement like Black Lives Matter, but I do know that Thomas did it with a finesse only a talented author like herself possibly could. With an unapologetically realistic delivery packed with emotion, The Hate U Give is a crucially important portrayal of the difficulties minorities face in our country every single day. I have no doubt that this book will be met with resistance by some (possibly many) and slapped with a “controversial” label, but if you've ever wondered what it was like to walk in a POC's shoes, then I feel like this is an unflinchingly honest place to start.In Angie Thomas's debut novel, Starr Carter bursts on to the YA scene with both heart-wrecking and heartwarming sincerity. This author is definitely one to watch."
  }
]
